/*The laboratory work №4
 1) Создать виртуальную клавиатуру с переназначаемыми действиями для клавиш
 и комбинаций клавиш с возможностью отката действий.
 2) Продемонстрировать работу клавиатуры, сделать Workflow из нажатий
 различных комбинаций клавиш и откатов назад. Симулировать демонстрацию
 нажатий клавиш путём вывода значения в консоль и задержкой между нажатиями.
 3) Продемонстрировать переназначение клавиши и комбинации клавиш с перезапуском
 Workflow.
 */
#include "Workflow.h"

int main() {
    Workflow();
    return 0;
}
